export interface Qna {
  id: number;
  category: '필독' | ''; 
  answer: string;
  title: string;   
  date: string;      
}

export const dummyQna: Qna[] = [
  {
    id: 1,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 2,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 3,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 4,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 5,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 6,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 7,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 8,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 9,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 10,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 11,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 12,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 13,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 13,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
  {
    id: 14,
    category: '필독',
    title: '베스트 글 선정 기준이 뭔가요 ',
    answer: `추천 수 5개 이상 + 댓글 3개 이상 + 조회수 300회 이상이면 자동 후보가 되며, 신고 이력이 없고 운영팀 검토 후 선정됩니다. `,
    date: '2025.07.26',
  },
]