export const PRIVACY_TEXT = `이게뭐예요?(이하 '회사'라고 합니다)는 개인정보보호법 등 관련 법령상의 개인정보보호 규정을 준수하며 귀하의 개인정보보호에 최선을 다하고 있습니다. 회사는 개인정보보호법에 근거하여 다음과 같은 내용으로 개인정보를 수집 및 처리하고자 합니다.

다음의 내용을 자세히 읽어보시고 모든 내용을 이해하신 후에 동의 여부를 결정해주시기 바랍니다.

**제1조 (개인정보 수집 및 이용 목적)**
이용자가 제공한 모든 정보는 다음의 목적을 위해 활용하며, 목적 이외의 용도로는 사용되지 않습니다.
- 회원 가입
- 서비스 제공 및 운영(로그인, 문의 응답 등)
- 부정 이용 방지 및 이용기록 관리
- 통계 분석 및 맞춤형 서비스 제공

**제2조 (개인정보 수집 및 이용 항목)**
회사가 개인정보 수집 목적을 위하여 다음과 같은 정보를 수집합니다.
[필수 수집 항목]
- 닉네임 및 이름
- 이메일 주소
- 비밀번호
- 아이디(ID)
- 접속 일시, 접속 IP, 서비스 이용기록, 쿠키 등
※ 일부 항목은 서비스 이용 과정에서 자동으로 생성·수집될 수 있습니다.

**제3조 (개인정보 보유 및 이용 기간)**
1. 수집한 개인정보는 수집, 이용 동의일로부터 5년간 보관 및 이용합니다.
2. 개인정보 보유기간의 경과, 처리목적의 달성 등 개인정보가 불필요하게 되었을 때에는 지체 없이 해당 개인정보를 파기합니다.

**제4조 (동의 거부 관리)**
귀하는 본 안내에 따른 개인정보 수집, 이용에 대하여 동의를 거부할 권리가 있습니다. 다만, 귀하가 개인정보 수집·이용에 동의를 거부하시는 경우에 서비스 이용 중 일부 제한의 불이익이 발생할 수 있음을 알려드립니다.
본인은 위의 동의서 내용을 충분히 숙지하였으며, 위와 같이 개인정보를 수집, 이용하는 데 동의합니다.`;
